Revit 2027 API
ExportRange Enumeration
 This enum is used to define what view, part of the view, or list of views will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExportRange
Public Enumeration ExportRange
public enum class ExportRange
type ExportRange
Members
Member name | Value | Description
CurrentView | 0 |  Export the current view only (zoom to fit of the current view).
SetOfViews | 2 |  Export a set of views (set in ViewsAndSheets).
VisibleRegionOfCurrentView | 1 |  Export the visible region of the current view.
See Also
Reference
Autodesk.Revit.DB Namespace